#Получаем массу, которую выдержит лодка, количество рыбаков
m = int(input("Введите массу, которую выдержит лодка: "))
n = int(input("Введите количество рыбаков: "))

#Вводим массу каждого рыбака
f = []

for i in range(n):
    f.append(int(input(f"Введите массу рыбака {i + 1}: ")))

#Распределяем рыбаков по лодкам
f.sort()
f_min = 0
f_max = n - 1
count = 0

while f_min <= f_max:
    if f[f_min] + f[f_max] <= m:
        f_min += 1
    f_max -= 1
    count += 1

#Выводим минимально количество лодок
print(f"Минимальное количество лодок: {count}")