#Получаем число
i = int(input())

#Проверяем число на четность и выводим соответствующее сообщение
if i % 2 == 0:
    if i == 0:
        print("нулевое число")
    elif i > 0:
        print("положительное четное число")
    else:
        print("отрицательное четное число")
else:
    print("число не является четным")
    if i == 0:
        print("нулевое нечетное число")
    elif i > 0:
        print("положительное нечетное число")
    else:
        print("отрицательное нечетное число")