#Создаём необходимый нам словарь и заполяем его пользовательскими данными
pets = dict()

name = input("Имя вашего питомца:\n")
pet_type = input("Вид вашего питомца:\n")
age = int(input("Возраст вашего питомца:\n"))
owner = input("Имя хозяина:\n")

pets[name] = {
    "Вид питомца": pet_type,
    "Возраст питомца": age,
    "Имя владельца": owner
}

#Выводим полученные данные
for n in pets:
    age_F = pets[n]["Возраст питомца"]
    if 11 <= age_F <= 20 or age_F % 10 in (5, 6, 7, 8, 9, 0):
        postf = "лет"
    elif age_F % 10 == 1:
        postf = "год"
    elif age_F % 10 in (2, 3, 4):
        postf = "года"
    print(f"Это {pets[n]['Вид питомца']} по кличке \"{n}\". Возраст питомца: {age_F} {postf}. Имя владельца: {pets[n]['Имя владельца']}")